In [1]:
import numpy as np
import pandas as pd

In [8]:
#creating a data frame

In [15]:
data = {
    "name" : ["Aryan","Rohit","Virat","Hardik"],
    "age" : [20,36,37,30],
    "city":["Haryana","Mumbai",'Delhi','Gujrat']
}
df = pd.DataFrame(data)

In [16]:
df

     name  age     city
0   Aryan   20  Haryana
1   Rohit   36   Mumbai
2   Virat   37    Delhi
3  Hardik   30   Gujrat

In [47]:
data_list = [
     ["Aryan",20,'haryana'],
     ['virat',36,'Delhi'],
     ["rohit",37,'Mumbia']
]
df2=pd.DataFrame(data_list)

In [48]:
df2

       0   1        2
0  Aryan  20  haryana
1  virat  36    Delhi
2  rohit  37   Mumbia

In [49]:
columns = ["name",'age','place']
pd3 = pd.DataFrame(data_list,columns=columns)

In [50]:
pd3

    name  age    place
0  Aryan   20  haryana
1  virat   36    Delhi
2  rohit   37   Mumbia

In [51]:
# selection and indexing of columns

In [52]:
df

     name  age     city
0   Aryan   20  Haryana
1   Rohit   36   Mumbai
2   Virat   37    Delhi
3  Hardik   30   Gujrat

In [53]:
df['name']

0     Aryan
1     Rohit
2     Virat
3    Hardik
Name: name, dtype: object

In [54]:
df[['name','age']]

     name  age
0   Aryan   20
1   Rohit   36
2   Virat   37
3  Hardik   30

In [55]:
#creating a column

In [56]:
df["salary"] = [7000000,2000000,1000000,5000000]

In [57]:
df

     name  age     city   salary
0   Aryan   20  Haryana  7000000
1   Rohit   36   Mumbai  2000000
2   Virat   37    Delhi  1000000
3  Hardik   30   Gujrat  5000000

In [58]:
#removing a column

In [59]:
df.drop('salary',axis = 1)  #it only show the deleted data but main data is not remove from data it is stored in memory

     name  age     city
0   Aryan   20  Haryana
1   Rohit   36   Mumbai
2   Virat   37    Delhi
3  Hardik   30   Gujrat

In [60]:
df  #here it can see data is still present

     name  age     city   salary
0   Aryan   20  Haryana  7000000
1   Rohit   36   Mumbai  2000000
2   Virat   37    Delhi  1000000
3  Hardik   30   Gujrat  5000000

In [61]:
df.drop(1,axis = 0)   #rows data delete

     name  age     city   salary
0   Aryan   20  Haryana  7000000
2   Virat   37    Delhi  1000000
3  Hardik   30   Gujrat  5000000

In [62]:
df

     name  age     city   salary
0   Aryan   20  Haryana  7000000
1   Rohit   36   Mumbai  2000000
2   Virat   37    Delhi  1000000
3  Hardik   30   Gujrat  5000000

In [63]:
df.drop('salary',axis=1,inplace=True)   #by using it  inplace=True  its delete data in memory anda cann't be retrieve

In [64]:
df

     name  age     city
0   Aryan   20  Haryana
1   Rohit   36   Mumbai
2   Virat   37    Delhi
3  Hardik   30   Gujrat

In [ ]:
#selecting rows

In [65]:
df

     name  age     city
0   Aryan   20  Haryana
1   Rohit   36   Mumbai
2   Virat   37    Delhi
3  Hardik   30   Gujrat

In [68]:
df.loc[[0]]

    name  age     city
0  Aryan   20  Haryana

In [69]:
df.iloc[[1]]  //i means index location

    name  age    city
1  Rohit   36  Mumbai

In [74]:
df.loc[[0,1]]

    name  age     city
0  Aryan   20  Haryana
1  Rohit   36   Mumbai

In [ ]:
#selecting Subsets Of Row And Column

In [77]:
df.loc[[0,1]][['age','city']]

   age     city
0   20  Haryana
1   36   Mumbai

In [83]:
df.loc[[1,2]][['name','age']]

    name  age
1  Rohit   36
2  Virat   37

In [ ]:
#conditional statement

In [84]:
df

     name  age     city
0   Aryan   20  Haryana
1   Rohit   36   Mumbai
2   Virat   37    Delhi
3  Hardik   30   Gujrat

In [86]:
df[df['age']>30]

    name  age    city
1  Rohit   36  Mumbai
2  Virat   37   Delhi

In [105]:
df[(df['age']>30) & (df['city']=='Delhi')]

    name  age   city
2  Virat   37  Delhi